package zoo.insightnote.domain.dummy.data;

import java.util.List;

public class UserDummyData {
    public static final List<String> JOBS = List.of(
            "백엔드 개발자", "프론트엔드 개발자", "풀스택 개발자", "iOS 개발자", "안드로이드 개발자",
            "AI 엔지니어", "데이터 엔지니어", "데이터 분석가", "데이터 사이언티스트", "ML Ops 엔지니어",
            "DevOps 엔지니어", "보안 엔지니어", "윤리적 해커", "SRE 엔지니어", "시스템 관리자",
            "서비스 기획자", "프로덕트 매니저", "기술 프로그램 매니저", "UX 디자이너", "UI 디자이너",
            "제품 디자이너", "AI 리서처", "리서치 사이언티스트", "게임 개발자", "IoT 엔지니어",
            "펌웨어 엔지니어", "클라우드 엔지니어", "NLP 엔지니어", "기술 컨설턴트", "기술 지원 전문가",
            "학생", "취업 준비생", "기타"
    );

    public static final List<String> OCCUPATIONS = List.of(
            "소프트웨어 개발", "데이터 및 인공지능", "클라우드 및 인프라", "정보 보안",
            "UX/UI 및 디자인", "게임 개발", "하드웨어 및 임베디드 시스템", "IT 기획 및 프로젝트 관리",
            "IT 지원 및 운영", "기술 컨설팅", "AI 연구", "교육 및 연구기관", "마케팅 및 기획",
            "비즈니스 분석 및 전략", "C-Level", "학생", "취업 준비생", "기타"
    );

    public static final List<String> INTEREST_CATEGORIES = List.of(
            "AI/머신러닝", "스마트 모빌리티", "5G/6G 네트워크", "블록체인",
            "DevOps", "IoT", "XR/메타버스", "데이터 과학", "사이버 보안", "클라우드 컴퓨팅"
    );

    public static final List<String> NICKNAMES = List.of(
            "별빛소년", "달토끼", "초코냥이", "코딩하는곰", "고래유영", "토끼발자국", "밤하늘수집가",
            "무지개펭귄", "냥코드", "깃헙요정", "디버깅천재", "커밋천사", "새벽타자", "구름걷는자",
            "감성로봇", "AI연금술사", "버그헌터", "풀스택라이언", "데이터여우", "알고리즘정령",
            "햇살코알라", "리액트유령", "클라우드곰", "망각고양이", "속도제왕", "헬로월드쥐",
            "스프링여제", "자바정령", "카페인개발자", "코딩하는마법사", "디자인너구리", "플러터펭귄",
            "도커도사", "UX고래", "컴파일타이거", "디버깅곰돌이", "백준요정", "기획너구리", "루트권한고양이",
            "프론트요정", "DB마스터", "디자인파스텔", "테스트천재", "알파코끼리", "버전의요정",
            "컴포넌트정령", "주석수집가", "로그냥이", "패키지여우", "코틀린펭귄", "객체여왕",
            "IDE유령", "레거시박멸단", "QA정령", "메모리도깨비", "스크럼도사", "시맨틱캥거루",
            "네이밍장인", "릴리즈마법사"
    );
}